<template>
  <div class="container mx-auto my-8  md:p-6 p-2">
   
      
      <div class="flex flex-wrap gap-5 xl:justify-between justify-center md:p-4 p-0 md:mx-3 ">

        <button
          v-for="(btn, i) in Collapsebutton"
          :key="i"
          @click="toggleCollapse(i)"
          :class="[
             'category-button px-18 sm:mb-4 mb-3 py-3 rounded-2xl  md:text-xl text-lg ',
             isOpen === i
              ? 'bg-[#10526B] text-white font-medium'
              : 'font-semibold bg-[#C7E0DCC7] text-[#10526B] font-semibold',
          ]"
        >
          {{ btn.name }}
        </button>
      </div>
      <div class="flex items-center my-16 px-10">
        <div class="flex-grow border-t border-[#10526B]"></div>
        <span class="px-4 md:text-xl text-lg font-bold text-[#10526B]"
          >الاسئله </span
        >
        <div class="flex-grow border-t border-[#10526B]"></div>
      </div>
      <div v-for="(btn, i) in Collapsebutton" :key="i" class="mb-4">
        <div v-show="isOpen === i">
          <div class="py-5 md:px-10 px-2">
            <div class="mb-3" v-for="(items, i) in visibleItems" :key="i">
                <div class="bg-[#C4C4C429] rounded-xl p-4 flex items-center md:flex-row flex-col">
      <div class="bg-[#10526B] text-white rounded-xl w-14 h-20  flex items-center justify-center md:mr-[-40px]">
        {{ i+1 }}
      </div>
    <div class="flex md:flex-row flex-col md:px-5 py-3 justify-around">
      <p class="md:w-9/12 w-full text-[#858686] md:text-xl text-lg">السؤال :
            {{ items.subject }}
       

      </p>
      <div class="md:w-2/12 w-full flex flex-col justify-center items-center ml-4">
      <img src="marker.png" alt="Icon" class="w-8 h-8 mb-2" />
      <nuxt-link to="/service/result" class="bg-[#BEAE73] text-center text-white py-1 px-3 rounded-xl w-full text-xl">
        الاجابة
    </nuxt-link>
      
    </div>
    </div>
    
  </div>
            
            </div>
          </div>
        </div>
      </div>

   
  </div>
</template>

<script setup>
import { ref, computed } from "vue";

const Collapsebutton = [
  {
    name: "الأديان والفلسفة الشرقية",
    id: 1,
    content: [
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
    ],
  },
  {
    name: "تطوير الذات والدورات التدريبية",
    id: 2,
    content: [
        {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
    ],
  },
  {
    name: "متفرقات",
    id: 3,
    content: [
        {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
    ],
  },
  {
    name: "القوانين الكونية والروحانية",
    id: 4,
    content: [
        {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
    ],
  },
  {
    name: "التصوف والروحانيات الحديثة",
    id: 5,
    content: [
        {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
    ],
  },
  {
    name: "الوعي النفسي بالعقل الباطن",
    id: 6,
    content: [
      {
        text: "الفصل الأول :",
        subject:
          "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject:
          "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الأول :",
        subject:
          "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject:
          "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
    ],
  },
  {
    name: "ممارسة الطاقة والطب البديل",
    id: 7,
    content: [
        {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
      {
        subject:
          " هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف....",
      },
    ],
  },
];
const isOpen = ref(null);
function toggleCollapse(index) {
  isOpen.value = isOpen.value === index ? null : index;
  currentIndex.value = 0; // Reset the current index when a new button is opened
}
const currentIndex = ref(0);

const visibleItems = computed(() => {
  if (isOpen.value !== null) {
    return Collapsebutton[isOpen.value].content;
  }
  return [];
});
</script>

<style scoped></style>
