<template>
  <div class="container mx-auto my-8 p-6">
    <div class="flex items-center">
      <span class="px-4 md:text-xl text-lg font-bold text-[#10526B]"
        >المصنف لابن أبي شبية</span
      >
      <div class="flex-grow border-t border-[#10526B]"></div>
    </div>
    <div class="w-full my-8 rounded-xl bg-[#C4C4C429]">
      <div class="grid sm:grid-cols-4 grid-cols-2 gap-4 bg-[#D9D9D9] rounded-t-xl">
        <button
          v-for="(btn, i) in Collapsebutton"
          :key="i"
          @click="toggleCollapse(i)"
          :class="[
            'w-full text-center p-3 text-lg focus:outline-none btnname',
            isOpen === i
              ? 'bg-[#10526B] text-white font-medium'
              : 'font-semibold text-[#10526B]',
          ]"
        >
          {{ btn.name }}
        </button>
      </div>
      <div v-for="(btn, i) in Collapsebutton" :key="i" class="mb-4">
        <div v-show="isOpen === i">
          <div class="py-5 sm:px-12 px-5">
            <div class="mb-3" v-for="(items, i) in visibleItems" :key="i">
                <h2 class="text-[#10526B] text-xl font-semibold">
                    {{ items.text }}
                </h2>
                <p class="text-[#8B8B8B] text-xl mb-4">
                    {{ items.subject }}
                </p>

            </div>
          </div>
         
        </div>
      </div>
    </div>

    <button class="mt-6 bg-[#BEAE73] text-white py-2 pr-5 pl-10 rounded-xl flex items-center">
        <img src="../../public/vector.png" class="w-5 h-5 rotate-[-90deg]" alt="">
        <p class="pr-5 text-xl mb-1">
            رجوع
        </p>
    </button>
  </div>
</template>

<script setup>
import { ref, computed } from "vue";

const Collapsebutton = [
  {
    name: "جدول القراءة",
    content: [
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
    ],
  },
  {
    name: "الأسئلة",
    content: [
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
    ],
  },
  {
    name: "الفوائد",
    content: [
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
    ],
  },
  {
    name: "خلاصات منتقاة",
    content: [
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الأول :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
      {
        text: "الفصل الثاني :",
        subject: "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.",
      },
    ],
  },
];
const isOpen = ref(null);
function toggleCollapse(index) {
  isOpen.value = isOpen.value === index ? null : index;
  currentIndex.value = 0; // Reset the current index when a new button is opened
}
const currentIndex = ref(0);

const visibleItems = computed(() => {
  if (isOpen.value !== null) {
  
    return Collapsebutton[isOpen.value].content;
  }
  return [];
});

</script>

<style scoped>
.btnname:nth-child(1){

}
</style>
